Revit 2025 API
ElectricalSystemType Enumeration
 An enumerated type listing all the possible electrical system types for a connector object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalSystemType
Public Enumeration ElectricalSystemType
public enum class ElectricalSystemType
type ElectricalSystemType
Members
Member name | Value | Description
UndefinedSystemType | 0 |  Undefined system type
Data | 5 |  Electrical System Type is Data.
PowerCircuit | 6 |  Electrical System Type is PowerCircuit.
Telephone | 9 |  Electrical System Type is Telephone.
Security | 10 |  Electrical System Type is Security
FireAlarm | 11 |  Electrical System Type is FireAlarm
NurseCall | 12 |  System Type is NurseCall.
Controls | 13 |  Electrical System Type is Controls.
Communication | 14 |  Electrical System Type is Communication.
PowerBalanced | 30 |  Electrical System Type is PowerBalanced.
PowerUnBalanced | 31 |  Electrical System Type is PowerUnBalanced.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace